app/Modules/Popular/DAO/DAOLogin.php

SELECT *
FROM `inscricao`
WHERE `email` = 'josue@gmail.com'
AND `senha` = '12345678'
---
    public function login($username, $password){
        $login = new InscricaoModel();
        $user = $login->where(['email' => $username, 'senha' => $password])->get()->getRow();