app/Modules/Popular/DAO/DAOUsuarios.php

INSERT INTO `votacao` (`id_inscricao`, `id_materia`, `voto`, `justificativa`, `created_at`, `updated_at`) VALUES ('61', '4', 1, 'Acho importante esta mudança', '2025-05-24 11:22:10', '2025-05-24 11:22:10')
---
    public function setVotacao($data)
    {
        $usuario = new VotacaoModel();
	$voto = 0;
	if($data['voto']=='aprovar'){
		$voto = 1;
	};

        $array = [
            'id_inscricao' => $data['id_inscricao'],
            'id_materia' => $data['materia_id'],
            'voto' => $voto,
            'justificativa' => $data['justificativa'],

        ];
        $result = $usuario->insert($array);