app/Modules/Land/DAO/DAOInscricao.php

INSERT INTO `inscricao` (`email`, `senha`, `created_at`, `updated_at`) VALUES ('dilamelo@hotmail.com', '12345678', '2025-05-15 21:00:05', '2025-05-15 21:00:05')
---
    public function newRecord($data)
    {
        $inscricao = new InscricaoModel();
        $array = [
            //'nome' => $data['nome'],
            //'documento' => $data['documento'],
            'email' => $data['email'],
            'senha' => $data['password'],

        ];
        $result = $inscricao->insert($array);